# Pandas Tutorial
Pandas is a open soure , BSD-licensed library prroviding high-performance , easy-to-use data structures and data analysis tools for python programming language

Agenda
. What is data frames ?
. What is data series ?
. Different Operation in Pandas

In [1]:
# first step is to import pandas
import pandas as pd
import numpy as np

In [2]:
#Playing with data frame
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=["Row1","Row2","Row3","Row4","Row5"],columns=["column1","column2","column3","column4"])

In [3]:
df

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [4]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [5]:
df.head(3)

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11

In [6]:
df.to_csv("test1.csv")

In [11]:
#accessing the element
## 1) .loc  2) .iloc

df.loc["Row1"]

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

In [12]:
type(df.loc["Row1"])

pandas.core.series.Series

In [14]:
 df.iloc[:3,:2]

      column1  column2
Row1        0        1
Row2        4        5
Row3        8        9

In [15]:
type(df.iloc[:3,:2])

pandas.core.frame.DataFrame

In [16]:
df.iloc[:,1:]

      column2  column3  column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [17]:
#convert dataframes into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [18]:
df.iloc[:,1:].values.shape

(5, 3)

In [19]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [22]:
df["column1"].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: column1, dtype: int64

In [23]:
df["column1"].unique()

array([ 0,  4,  8, 12, 16])